In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
ser1 = Series([0, 1, 2], index = ['A', 'B', 'C'])
ser1

A    0
B    1
C    2
dtype: int64

In [3]:
ser2 = Series([3, 4, 5, 6], index = ['A', 'B', 'C', 'D'])
ser2

A    3
B    4
C    5
D    6
dtype: int64

In [4]:
ser1 + ser2

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [5]:
df1 = DataFrame(np.arange(4).reshape((2, 2)), columns = list('AB'), index = ['NYC', 'LA'])
df1

     A  B
NYC  0  1
LA   2  3

In [14]:
df2 = DataFrame(4 * np.arange(9).reshape((3, 3)) + 5, columns = list('ADC'), index = ['NYC', 'SF', 'LA'])
df2

      A   D   C
NYC   5   9  13
SF   17  21  25
LA   29  33  37

In [15]:
df1 + df2

        A   B   C   D
LA   31.0 NaN NaN NaN
NYC   5.0 NaN NaN NaN
SF    NaN NaN NaN NaN

In [16]:
df1.add(df2, fill_value = 0)

        A    B     C     D
LA   31.0  3.0  37.0  33.0
NYC   5.0  1.0  13.0   9.0
SF   17.0  NaN  25.0  21.0